###################################################################

# Created by write_sdc on Fri Apr 24 10:51:09 2020

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_transition 2 [current_design]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency -max 0.8  [get_clocks clk]
set_clock_latency -min 0.4  [get_clocks clk]
set_clock_uncertainty -setup 0.2  [get_clocks clk]
set_clock_uncertainty -hold 0.1  [get_clocks clk]
set_clock_transition -min -fall 1 [get_clocks clk]
set_clock_transition -min -rise 1 [get_clocks clk]
set_clock_transition -max -fall 1 [get_clocks clk]
set_clock_transition -max -rise 1 [get_clocks clk]
group_path -name FEEDTHROUGH  -from [list [get_ports rst] [get_ports fromMemoryPortxLOADEDDATAx(31)] [get_ports fromMemoryPortxLOADEDDATAx(30)] [get_ports fromMemoryPortxLOADEDDATAx(29)] [get_ports fromMemoryPortxLOADEDDATAx(28)] [get_ports fromMemoryPortxLOADEDDATAx(27)] [get_ports fromMemoryPortxLOADEDDATAx(26)] [get_ports fromMemoryPortxLOADEDDATAx(25)] [get_ports fromMemoryPortxLOADEDDATAx(24)] [get_ports fromMemoryPortxLOADEDDATAx(23)] [get_ports fromMemoryPortxLOADEDDATAx(22)] [get_ports fromMemoryPortxLOADEDDATAx(21)] [get_ports fromMemoryPortxLOADEDDATAx(20)] [get_ports fromMemoryPortxLOADEDDATAx(19)] [get_ports fromMemoryPortxLOADEDDATAx(18)] [get_ports fromMemoryPortxLOADEDDATAx(17)] [get_ports fromMemoryPortxLOADEDDATAx(16)] [get_ports fromMemoryPortxLOADEDDATAx(15)] [get_ports fromMemoryPortxLOADEDDATAx(14)] [get_ports fromMemoryPortxLOADEDDATAx(13)] [get_ports fromMemoryPortxLOADEDDATAx(12)] [get_ports fromMemoryPortxLOADEDDATAx(11)] [get_ports fromMemoryPortxLOADEDDATAx(10)] [get_ports fromMemoryPortxLOADEDDATAx(9)] [get_ports fromMemoryPortxLOADEDDATAx(8)] [get_ports fromMemoryPortxLOADEDDATAx(7)] [get_ports fromMemoryPortxLOADEDDATAx(6)] [get_ports fromMemoryPortxLOADEDDATAx(5)] [get_ports fromMemoryPortxLOADEDDATAx(4)] [get_ports fromMemoryPortxLOADEDDATAx(3)] [get_ports fromMemoryPortxLOADEDDATAx(2)] [get_ports fromMemoryPortxLOADEDDATAx(1)] [get_ports fromMemoryPortxLOADEDDATAx(0)] [get_ports fromMemoryPort_sync] [get_ports toMemoryPort_sync]]  -to [list [get_ports fromMemoryPort_notify] [get_ports toMemoryPortxADDRINxx31x] [get_ports toMemoryPortxADDRINxx30x] [get_ports toMemoryPortxADDRINxx29x] [get_ports toMemoryPortxADDRINxx28x] [get_ports toMemoryPortxADDRINxx27x] [get_ports toMemoryPortxADDRINxx26x] [get_ports toMemoryPortxADDRINxx25x] [get_ports toMemoryPortxADDRINxx24x] [get_ports toMemoryPortxADDRINxx23x] [get_ports toMemoryPortxADDRINxx22x] [get_ports toMemoryPortxADDRINxx21x] [get_ports toMemoryPortxADDRINxx20x] [get_ports toMemoryPortxADDRINxx19x] [get_ports toMemoryPortxADDRINxx18x] [get_ports toMemoryPortxADDRINxx17x] [get_ports toMemoryPortxADDRINxx16x] [get_ports toMemoryPortxADDRINxx15x] [get_ports toMemoryPortxADDRINxx14x] [get_ports toMemoryPortxADDRINxx13x] [get_ports toMemoryPortxADDRINxx12x] [get_ports toMemoryPortxADDRINxx11x] [get_ports toMemoryPortxADDRINxx10x] [get_ports toMemoryPortxADDRINxx9x] [get_ports toMemoryPortxADDRINxx8x] [get_ports toMemoryPortxADDRINxx7x] [get_ports toMemoryPortxADDRINxx6x] [get_ports toMemoryPortxADDRINxx5x] [get_ports toMemoryPortxADDRINxx4x] [get_ports toMemoryPortxADDRINxx3x] [get_ports toMemoryPortxADDRINxx2x] [get_ports toMemoryPortxADDRINxx1x] [get_ports toMemoryPortxADDRINxx0x] [get_ports toMemoryPortxDATAINxx31x] [get_ports toMemoryPortxDATAINxx30x] [get_ports toMemoryPortxDATAINxx29x] [get_ports toMemoryPortxDATAINxx28x] [get_ports toMemoryPortxDATAINxx27x] [get_ports toMemoryPortxDATAINxx26x] [get_ports toMemoryPortxDATAINxx25x] [get_ports toMemoryPortxDATAINxx24x] [get_ports toMemoryPortxDATAINxx23x] [get_ports toMemoryPortxDATAINxx22x] [get_ports toMemoryPortxDATAINxx21x] [get_ports toMemoryPortxDATAINxx20x] [get_ports toMemoryPortxDATAINxx19x] [get_ports toMemoryPortxDATAINxx18x] [get_ports toMemoryPortxDATAINxx17x] [get_ports toMemoryPortxDATAINxx16x] [get_ports toMemoryPortxDATAINxx15x] [get_ports toMemoryPortxDATAINxx14x] [get_ports toMemoryPortxDATAINxx13x] [get_ports toMemoryPortxDATAINxx12x] [get_ports toMemoryPortxDATAINxx11x] [get_ports toMemoryPortxDATAINxx10x] [get_ports toMemoryPortxDATAINxx9x] [get_ports toMemoryPortxDATAINxx8x] [get_ports toMemoryPortxDATAINxx7x] [get_ports toMemoryPortxDATAINxx6x] [get_ports toMemoryPortxDATAINxx5x] [get_ports toMemoryPortxDATAINxx4x] [get_ports toMemoryPortxDATAINxx3x] [get_ports toMemoryPortxDATAINxx2x] [get_ports toMemoryPortxDATAINxx1x] [get_ports toMemoryPortxDATAINxx0x] [get_ports toMemoryPortxMASKxx2x] [get_ports toMemoryPortxMASKxx1x] [get_ports toMemoryPortxMASKxx0x] [get_ports toMemoryPortxREQxx1x] [get_ports toMemoryPortxREQxx0x] [get_ports toMemoryPort_notify]]
group_path -name REGIN  -from [list [get_ports rst] [get_ports fromMemoryPortxLOADEDDATAx(31)] [get_ports fromMemoryPortxLOADEDDATAx(30)] [get_ports fromMemoryPortxLOADEDDATAx(29)] [get_ports fromMemoryPortxLOADEDDATAx(28)] [get_ports fromMemoryPortxLOADEDDATAx(27)] [get_ports fromMemoryPortxLOADEDDATAx(26)] [get_ports fromMemoryPortxLOADEDDATAx(25)] [get_ports fromMemoryPortxLOADEDDATAx(24)] [get_ports fromMemoryPortxLOADEDDATAx(23)] [get_ports fromMemoryPortxLOADEDDATAx(22)] [get_ports fromMemoryPortxLOADEDDATAx(21)] [get_ports fromMemoryPortxLOADEDDATAx(20)] [get_ports fromMemoryPortxLOADEDDATAx(19)] [get_ports fromMemoryPortxLOADEDDATAx(18)] [get_ports fromMemoryPortxLOADEDDATAx(17)] [get_ports fromMemoryPortxLOADEDDATAx(16)] [get_ports fromMemoryPortxLOADEDDATAx(15)] [get_ports fromMemoryPortxLOADEDDATAx(14)] [get_ports fromMemoryPortxLOADEDDATAx(13)] [get_ports fromMemoryPortxLOADEDDATAx(12)] [get_ports fromMemoryPortxLOADEDDATAx(11)] [get_ports fromMemoryPortxLOADEDDATAx(10)] [get_ports fromMemoryPortxLOADEDDATAx(9)] [get_ports fromMemoryPortxLOADEDDATAx(8)] [get_ports fromMemoryPortxLOADEDDATAx(7)] [get_ports fromMemoryPortxLOADEDDATAx(6)] [get_ports fromMemoryPortxLOADEDDATAx(5)] [get_ports fromMemoryPortxLOADEDDATAx(4)] [get_ports fromMemoryPortxLOADEDDATAx(3)] [get_ports fromMemoryPortxLOADEDDATAx(2)] [get_ports fromMemoryPortxLOADEDDATAx(1)] [get_ports fromMemoryPortxLOADEDDATAx(0)] [get_ports fromMemoryPort_sync] [get_ports toMemoryPort_sync]]
group_path -name REGOUT  -to [list [get_ports fromMemoryPort_notify] [get_ports toMemoryPortxADDRINxx31x] [get_ports toMemoryPortxADDRINxx30x] [get_ports toMemoryPortxADDRINxx29x] [get_ports toMemoryPortxADDRINxx28x] [get_ports toMemoryPortxADDRINxx27x] [get_ports toMemoryPortxADDRINxx26x] [get_ports toMemoryPortxADDRINxx25x] [get_ports toMemoryPortxADDRINxx24x] [get_ports toMemoryPortxADDRINxx23x] [get_ports toMemoryPortxADDRINxx22x] [get_ports toMemoryPortxADDRINxx21x] [get_ports toMemoryPortxADDRINxx20x] [get_ports toMemoryPortxADDRINxx19x] [get_ports toMemoryPortxADDRINxx18x] [get_ports toMemoryPortxADDRINxx17x] [get_ports toMemoryPortxADDRINxx16x] [get_ports toMemoryPortxADDRINxx15x] [get_ports toMemoryPortxADDRINxx14x] [get_ports toMemoryPortxADDRINxx13x] [get_ports toMemoryPortxADDRINxx12x] [get_ports toMemoryPortxADDRINxx11x] [get_ports toMemoryPortxADDRINxx10x] [get_ports toMemoryPortxADDRINxx9x] [get_ports toMemoryPortxADDRINxx8x] [get_ports toMemoryPortxADDRINxx7x] [get_ports toMemoryPortxADDRINxx6x] [get_ports toMemoryPortxADDRINxx5x] [get_ports toMemoryPortxADDRINxx4x] [get_ports toMemoryPortxADDRINxx3x] [get_ports toMemoryPortxADDRINxx2x] [get_ports toMemoryPortxADDRINxx1x] [get_ports toMemoryPortxADDRINxx0x] [get_ports toMemoryPortxDATAINxx31x] [get_ports toMemoryPortxDATAINxx30x] [get_ports toMemoryPortxDATAINxx29x] [get_ports toMemoryPortxDATAINxx28x] [get_ports toMemoryPortxDATAINxx27x] [get_ports toMemoryPortxDATAINxx26x] [get_ports toMemoryPortxDATAINxx25x] [get_ports toMemoryPortxDATAINxx24x] [get_ports toMemoryPortxDATAINxx23x] [get_ports toMemoryPortxDATAINxx22x] [get_ports toMemoryPortxDATAINxx21x] [get_ports toMemoryPortxDATAINxx20x] [get_ports toMemoryPortxDATAINxx19x] [get_ports toMemoryPortxDATAINxx18x] [get_ports toMemoryPortxDATAINxx17x] [get_ports toMemoryPortxDATAINxx16x] [get_ports toMemoryPortxDATAINxx15x] [get_ports toMemoryPortxDATAINxx14x] [get_ports toMemoryPortxDATAINxx13x] [get_ports toMemoryPortxDATAINxx12x] [get_ports toMemoryPortxDATAINxx11x] [get_ports toMemoryPortxDATAINxx10x] [get_ports toMemoryPortxDATAINxx9x] [get_ports toMemoryPortxDATAINxx8x] [get_ports toMemoryPortxDATAINxx7x] [get_ports toMemoryPortxDATAINxx6x] [get_ports toMemoryPortxDATAINxx5x] [get_ports toMemoryPortxDATAINxx4x] [get_ports toMemoryPortxDATAINxx3x] [get_ports toMemoryPortxDATAINxx2x] [get_ports toMemoryPortxDATAINxx1x] [get_ports toMemoryPortxDATAINxx0x] [get_ports toMemoryPortxMASKxx2x] [get_ports toMemoryPortxMASKxx1x] [get_ports toMemoryPortxMASKxx0x] [get_ports toMemoryPortxREQxx1x] [get_ports toMemoryPortxREQxx0x] [get_ports toMemoryPort_notify]]
set_false_path   -from [get_ports rst]  -to [get_clocks clk]
set_input_delay -clock clk  5  [get_ports clk]
set_input_delay -clock clk  5  [get_ports rst]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(31)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(30)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(29)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(28)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(27)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(26)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(25)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(24)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(23)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(22)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(21)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(20)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(19)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(18)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(17)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(16)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(15)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(14)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(13)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(12)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(11)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(10)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(9)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(8)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(7)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(6)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(5)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(4)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(3)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(2)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(1)]
set_input_delay -clock clk  5  [get_ports fromMemoryPortxLOADEDDATAx(0)]
set_input_delay -clock clk  5  [get_ports fromMemoryPort_sync]
set_input_delay -clock clk  5  [get_ports toMemoryPort_sync]
set_output_delay -clock clk  5  [get_ports fromMemoryPort_notify]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx31x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx30x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx29x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx28x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx27x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx26x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx25x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx24x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx23x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx22x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx21x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx20x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx19x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx18x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx17x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx16x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx15x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx14x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx13x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx12x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx11x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx10x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx9x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx8x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx7x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx6x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx5x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx4x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx3x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx2x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx1x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxADDRINxx0x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx31x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx30x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx29x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx28x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx27x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx26x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx25x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx24x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx23x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx22x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx21x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx20x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx19x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx18x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx17x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx16x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx15x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx14x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx13x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx12x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx11x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx10x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx9x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx8x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx7x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx6x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx5x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx4x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx3x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx2x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx1x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxDATAINxx0x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxMASKxx2x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxMASKxx1x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxMASKxx0x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxREQxx1x]
set_output_delay -clock clk  5  [get_ports toMemoryPortxREQxx0x]
set_output_delay -clock clk  5  [get_ports toMemoryPort_notify]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_01x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_01x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_01x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_01x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_02x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_02x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_02x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_02x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_03x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_03x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_03x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_03x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_04x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_04x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_04x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_04x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_05x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_05x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_05x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_05x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_06x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_06x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_06x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_06x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_07x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_07x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_07x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_07x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_08x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_08x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_08x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_08x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_09x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_09x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_09x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_09x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_10x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_10x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_10x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_10x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_11x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_11x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_11x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_11x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_12x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_12x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_12x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_12x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_13x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_13x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_13x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_13x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_14x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_14x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_14x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_14x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_15x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_15x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_15x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_15x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_16x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_16x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_16x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_16x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_17x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_17x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_17x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_17x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_18x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_18x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_18x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_18x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_19x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_19x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_19x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_19x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_20x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_20x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_20x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_20x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_21x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_21x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_21x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_21x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_22x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_22x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_22x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_22x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_23x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_23x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_23x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_23x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_24x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_24x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_24x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_24x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_25x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_25x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_25x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_25x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_26x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_26x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_26x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_26x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_27x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_27x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_27x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_27x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_28x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_28x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_28x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_28x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_29x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_29x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_29x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_29x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_30x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_30x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_30x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_30x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_31x/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_31x/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_31x/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_RegsxRegsToCtl_port_regxREG_FILE_31x/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxADDRINx/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxADDRINx/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxADDRINx/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxADDRINx/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxREQx/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxREQx/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxREQx/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_regxREQx/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxpcReg_signal_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxpcReg_signal_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxpcReg_signal_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxpcReg_signal_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTx/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTx/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTx/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTx/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTDATAx/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTDATAx/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTDATAx/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxtoRegsPort_regxDSTDATAx/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_notify_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_notify_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_notify_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_IF_ISAxtoMemoryPort_notify_reg/main_gate]
